In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('data/weight-height.csv')

# какие типы признаков в нашем датафрейме?
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [3]:
# переведем в килограммы и сантиметры
df['Height'] = df['Height'] * 2.54
df['Weight'] = df['Weight'] * 0.45
df.head()

  Gender      Height      Weight
0   Male  187.571423  108.852103
1   Male  174.706036   73.039713
2   Male  188.239668   95.733385
3   Male  182.196685   99.019112
4   Male  177.499761   92.857410

# Минимум, максимум и размах

In [4]:
print(max(df['Height']))
print(np.max(df['Height']))
print(df['Height'].max())

200.65680555982956
200.65680555982956
200.65680555982956

In [5]:
print(min(df['Weight']))
print(np.min(df['Weight']))
print(df['Weight'].min())

29.115057020738853
29.115057020738853
29.115057020738853

In [6]:
df[df['Weight'] ==13.101775659332484]

Empty DataFrame
Columns: [Gender, Height, Weight]
Index: []

In [7]:
# размах – разница между минимальным и максимальным значением
weight_range = df['Weight'].max() - df['Weight'].min()
height_range = df['Height'].max() - df['Height'].min()
print(weight_range)
print(height_range)

92.38030730655885
62.82844691408292

# Среднеарифметическое

In [ ]:
# ручной подсчет
sum(df['Weight']) / len(df['Weight'])

In [ ]:
print(np.mean(df['Weight']))
print(df['Weight'].mean())

# Мода

In [9]:
weight_counts = {}
for w in df['Weight'].round():
    if w not in weight_counts:
        weight_counts[w] = 1
    else:
        weight_counts[w] += 1

In [10]:
weight_counts

{109.0: 5,
 73.0: 199,
 96.0: 84,
 99.0: 50,
 93.0: 153,
 68.0: 205,
 83.0: 223,
 76.0: 196,
 79.0: 236,
 70.0: 188,
 84.0: 245,
 75.0: 205,
 85.0: 233,
 77.0: 192,
 88.0: 209,
 78.0: 213,
 82.0: 230,
 89.0: 184,
 67.0: 204,
 103.0: 27,
 87.0: 228,
 69.0: 207,
 92.0: 148,
 74.0: 205,
 94.0: 128,
 86.0: 193,
 95.0: 111,
 90.0: 192,
 81.0: 199,
 80.0: 230,
 97.0: 69,
 107.0: 5,
 72.0: 191,
 91.0: 177,
 71.0: 198,
 100.0: 40,
 66.0: 225,
 106.0: 7,
 104.0: 17,
 98.0: 74,
 101.0: 39,
 105.0: 10,
 61.0: 227,
 108.0: 10,
 63.0: 239,
 102.0: 27,
 65.0: 230,
 58.0: 216,
 56.0: 202,
 59.0: 225,
 115.0: 2,
 60.0: 242,
 64.0: 248,
 62.0: 269,
 112.0: 4,
 111.0: 3,
 51.0: 117,
 121.0: 1,
 114.0: 3,
 54.0: 157,
 55.0: 181,
 57.0: 195,
 113.0: 2,
 53.0: 148,
 46.0: 64,
 52.0: 125,
 50.0: 110,
 47.0: 56,
 48.0: 70,
 44.0: 35,
 49.0: 84,
 38.0: 5,
 41.0: 18,
 42.0: 17,
 43.0: 30,
 45.0: 36,
 40.0: 9,
 31.0: 1,
 36.0: 2,
 39.0: 8,
 32.0: 1,
 35.0: 3,
 37.0: 2,
 29.0: 1,
 33.0: 1}

In [8]:
# Создаём пустой словарь, в котором будем считать количество появлений значений веса
weight_counts = {}
for w in df['Weight'].round():
    if w not in weight_counts:
        weight_counts[w] = 1
    else:
        weight_counts[w] += 1

# Проходимся по словарю и ищем максимальное количество повторений
# Алгоритм поиска максимума
maxw = 0
mode_weight = None
for k, v in weight_counts.items():
    if maxw < v:
        maxw = v
        mode_weight = k
print('Значение моды:', mode_weight, 'количество встречаемости:', maxw)

Значение моды: 62.0 количество встречаемости: 269

In [11]:
print('Значение моды: ', df['Weight'].round().mode()[0])

Значение моды:  62.0

In [17]:
df['Weight'].round().mode()[0]

62.0

# Медиана

In [19]:
# ручной подсчет
height = df['Height']

# Находим  количество значений
num_height = len(df['Height'])

# Сортируем в порядке возрастания
sorted_height = sorted(height)

# Ищем индекс среднего элемента
# если количество элементов четное, то берем среднее двух элементов в середине
middle = (num_height // 2)
if num_height % 2 == 0:
    result = (sorted_height[middle-1] + sorted_height[middle])/2
else:
    result = sorted_height[middle]
# Находим медиану
print('Медиана: ', result)

Медиана:  168.44789800773304

In [18]:
print(df['Height'].median())
print(np.median(df['Height']))

168.44789800773304
168.44789800773304

# СКО

In [ ]:
# ручной подсчет
def stdev(nums):
    diffs = 0
    # считаем среднее значение
    avg = sum(nums) / len(nums)
    for n in nums:
        # считаем сумму квадратичных отклонений
        diffs += (n - avg) ** (2)
    # считаем корень среднеквадратичного значения
    return (diffs / (len(nums) - 1)) ** (0.5)

stdev(df['Height'])

In [20]:
print('Рост')
print(df['Height'].std())
print(np.std(df['Height'], ddof=1)) # дельта степеней свободы в numpy по-умолчанию 0

print('Вес')
print(df['Weight'].std())
print(np.std(df['Weight'], ddof=1))

Рост
9.772721426763992
9.772721426763992
Вес
14.448797552933803
14.448797552933803

# Дисперсия

In [ ]:
# ручной подсчет
def disp(nums):
    diffs = 0
    # считаем среднее значение
    avg = sum(nums)/len(nums)
    for n in nums:
        # считаем сумму квадратичных отклонений
        diffs += (n - avg)**(2)
    # считаем среднеквадратичного значения
    return diffs/(len(nums)-1)

print(disp(df.Height))
print(disp(df.Weight))

In [21]:
print('Рост')
print(np.var(df['Height'], ddof=1))
print(df['Height'].var())

print('Вес')
print(np.var(df['Weight'], ddof=1))
print(df['Weight'].var())

Рост
95.50608408513203
95.50608408513203
Вес
208.76775072566585
208.76775072566585

# Квантили

In [25]:
# это же медиана!
df['Height'].quantile()

168.44789800773304

In [28]:
# первый и третий квартили
df['Height'].quantile([0.25, 0.5, 0.75])

0.25    161.304276
0.50    168.447898
0.75    175.702625
Name: Height, dtype: float64

In [ ]:
# произвольный перцентиль
df['Height'].quantile(0.33)

In [36]:
# межквартильный размах
Q1 = df['Height'].quantile(0.25)
Q3 = df['Height'].quantile(0.75)
IQR = Q3 - Q1
IQR

14.398348763863964

# Describe

In [29]:
df.describe()

             Height        Weight
count  10000.000000  10000.000000
mean     168.573602     72.648161
std        9.772721     14.448798
min      137.828359     29.115057
25%      161.304276     61.118123
50%      168.447898     72.545817
75%      175.702625     84.226286
max      200.656806    121.495364

# Выбросы

In [30]:
# тыкнем пальцем в небо (определим выбросы вручную) и посмотрим, как изменились средние
print(df['Weight'].mean())
print(df[(df['Weight'] > 50) & (df['Weight'] < 150)]['Weight'].mean())

72.64816057477414
74.04876258391826

In [31]:
df[(df['Weight'] > 50) & (df['Weight'] < 150)]

      Gender      Height      Weight
0       Male  187.571423  108.852103
1       Male  174.706036   73.039713
2       Male  188.239668   95.733385
3       Male  182.196685   99.019112
4       Male  177.499761   92.857410
...      ...         ...         ...
9995  Female  168.078536   61.549854
9996  Female  170.350573   76.890558
9997  Female  162.224700   57.813893
9998  Female  175.346978   73.733608
9999  Female  157.338385   51.142096

[9499 rows x 3 columns]

In [32]:
# а медиана?
print(df['Weight'].median())
print(df[(df['Weight'] > 50) & (df['Weight'] < 150)]['Weight'].median())

72.54581746476735
73.7809355907585

In [33]:
# ну с модой все понятно
print(df['Weight'].round().mode()[0])
print(df[(df['Weight'] > 50) & (df['Weight'] < 150)]['Weight'].round().mode()[0])

62.0
62.0

А теперь найдем выбросы через межквартльный размах (на примере роста)

In [58]:
df[df['Weight'].between(26.455878432327843, 118.8885308460554, inclusive=True)]

      Gender      Height      Weight
0       Male  187.571423  108.852103
1       Male  174.706036   73.039713
2       Male  188.239668   95.733385
3       Male  182.196685   99.019112
4       Male  177.499761   92.857410
...      ...         ...         ...
9995  Female  168.078536   61.549854
9996  Female  170.350573   76.890558
9997  Female  162.224700   57.813893
9998  Female  175.346978   73.733608
9999  Female  157.338385   51.142096

[9999 rows x 3 columns]

In [59]:
q1 = df['Weight'].quantile(0.25)
q3 = df['Weight'].quantile(0.75)
iqr = q3 - q1
lower_bound = q1 - (1.5 * iqr) 
upper_bound = q3 + (1.5 * iqr)
remove_outliers = df[df['Weight'].between(lower_bound, upper_bound, inclusive=True)].sort_values('Height')

print(lower_bound, upper_bound)
print(iqr)
remove_outliers

26.455878432327843 118.8885308460554
23.10816310343189

      Gender      Height      Weight
9285  Female  137.828359   29.115057
6624  Female  138.726819   32.127187
7294  Female  139.379268   35.373002
7617  Female  140.077336   39.965585
5345  Female  140.554691   39.764962
...      ...         ...         ...
4569    Male  196.969853  108.918528
994     Male  198.363503  115.060876
1317    Male  199.293614  102.304154
3285    Male  199.461654  114.250052
3757    Male  199.698290  110.580202

[9999 rows x 3 columns]

In [60]:
# что это за выброс?
pd.concat([df, remove_outliers]).drop_duplicates(keep=False)

     Gender      Height      Weight
2014   Male  200.656806  121.495364

In [61]:
print(remove_outliers['Height'].mean())
print(remove_outliers['Height'].median())

168.57039313600353
168.4474645316641

In [62]:
print(df['Height'].mean() - remove_outliers['Height'].mean())

0.0032086412424803257

In [63]:
print(df['Height'].median() - remove_outliers['Height'].median())

0.000433476068934624

# Пропуски

In [65]:
titanic = pd.read_csv('data/titanic.csv')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Если в данных пропуски представлены в виде каких-то конкретных значений (пустые строк, -, ? и пр.), то используйте аргумент na_values при чтении файла.

In [69]:
(titanic.isna().mean() * 100).round(2)

PassengerId     0.00
Survived        0.00
Pclass          0.00
Name            0.00
Sex             0.00
Age            19.87
SibSp           0.00
Parch           0.00
Ticket          0.00
Fare            0.00
Cabin          77.10
Embarked        0.22
dtype: float64

## Игнорирование пропусков

In [67]:
# все методы pandas по-умолчанию просто не берут в расчет пропуски
print(titanic.Age.mean())
print(titanic.Age.median())
print(titanic.Age.mode()[0])

print(titanic.Age.std())
print(titanic.Age.var())

29.69911764705882
28.0
24.0
14.526497332334044
211.0191247463081

## Удаление строк с пропусками

In [ ]:
titanic.dropna().info()

In [ ]:
# посмотрите на сколько исказились статистики, если мы удалим все строки с пропусками
print(titanic.dropna()['Age'].mean())
print(titanic.dropna()['Age'].median())
print(titanic.dropna()['Age'].mode()[0])

print(titanic.dropna()['Age'].std())
print(titanic.dropna()['Age'].var())

In [68]:
# предположим, мы хотим оставить только те строки, в которых как минимум 11/12 значений заполнено
titanic.dropna(thresh=11).info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 733 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  733 non-null    int64
 1   Survived     733 non-null    int64
 2   Pclass       733 non-null    int64
 3   Name         733 non-null    object
 4   Sex          733 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        733 non-null    int64
 7   Parch        733 non-null    int64
 8   Ticket       733 non-null    object
 9   Fare         733 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     731 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 74.4+ KB

## Удаление столбцов с пропусками

In [ ]:
# удалять все в данном случае – странно
titanic.dropna(axis = 1).info()

In [ ]:
# у нас очень много пропусков в Cabin. Нам эта информация точно нунжа?
titanic.drop(['Cabin'], axis=1).info()

## Замена пропусков

Замена на определенное значение

In [70]:
titanic['Cabin'].fillna('no_info', inplace=True)
print(titanic['Cabin'].isna().sum())
print(titanic['Cabin'].unique())

0
['no_info' 'C85' 'C123' 'E46' 'G6' 'C103' 'D56' 'A6' 'C23 C25 C27' 'B78'
 'D33' 'B30' 'C52' 'B28' 'C83' 'F33' 'F G73' 'E31' 'A5' 'D10 D12' 'D26'
 'C110' 'B58 B60' 'E101' 'F E69' 'D47' 'B86' 'F2' 'C2' 'E33' 'B19' 'A7'
 'C49' 'F4' 'A32' 'B4' 'B80' 'A31' 'D36' 'D15' 'C93' 'C78' 'D35' 'C87'
 'B77' 'E67' 'B94' 'C125' 'C99' 'C118' 'D7' 'A19' 'B49' 'D' 'C22 C26'
 'C106' 'C65' 'E36' 'C54' 'B57 B59 B63 B66' 'C7' 'E34' 'C32' 'B18' 'C124'
 'C91' 'E40' 'T' 'C128' 'D37' 'B35' 'E50' 'C82' 'B96 B98' 'E10' 'E44'
 'A34' 'C104' 'C111' 'C92' 'E38' 'D21' 'E12' 'E63' 'A14' 'B37' 'C30' 'D20'
 'B79' 'E25' 'D46' 'B73' 'C95' 'B38' 'B39' 'B22' 'C86' 'C70' 'A16' 'C101'
 'C68' 'A10' 'E68' 'B41' 'A20' 'D19' 'D50' 'D9' 'A23' 'B50' 'A26' 'D48'
 'E58' 'C126' 'B71' 'B51 B53 B55' 'D49' 'B5' 'B20' 'F G63' 'C62 C64' 'E24'
 'C90' 'C45' 'E8' 'B101' 'D45' 'C46' 'D30' 'E121' 'D11' 'E77' 'F38' 'B3'
 'D6' 'B82 B84' 'D17' 'A36' 'B102' 'B69' 'E49' 'C47' 'D28' 'E17' 'A24'
 'C50' 'B42' 'C148']

Замена средним

In [72]:
# возраст дискретен, при заполнении средними еще стоит округлить. Проигнорируем в учебных целях

fill_mean = pd.read_csv('data/titanic.csv')

fill_mean['Age'].fillna(titanic['Age'].mean(), inplace=True)
fill_mean['Age'].fillna(titanic['Age'].mean()).isna().sum()

0

In [ ]:
print(titanic['Age'].describe())
print('-----------------------------------')
print(fill_mean['Age'].describe())

Замена медианой

In [ ]:
fill_median = pd.read_csv('titanic.csv')

fill_median['Age'].fillna(titanic['Age'].median(), inplace=True)
fill_median['Age'].fillna(titanic['Age'].median()).isna().sum()

In [ ]:
print(titanic['Age'].describe())
print('-----------------------------------')
print(fill_median['Age'].describe())

Замена модой

In [75]:
titanic['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [74]:
titanic_fill_mode = pd.read_csv('data/titanic.csv')
titanic_fill_mode['Embarked'].fillna(titanic['Embarked'].mode()[0], inplace=True)

titanic_fill_mode['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

В большинстве случаев это слишком наивные варианты заполнения, как минимум стоит заполнять значениями в разрезе других признаков (когда применимо).

Заполнение пропусков с группировкой по
одной переменной

In [82]:
# мы не можем исключать, что средний возраст мужчин и женщин отличался
print(titanic.groupby('Sex')['Age'].median())
fill_median_by_gender = pd.read_csv('data/titanic.csv')
fill_median_by_gender['Age'].fillna(titanic.groupby('Sex')['Age'].transform('median'), inplace=True)
fill_median_by_gender

Sex
female    27.0
male      29.0
Name: Age, dtype: float64

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,27.0,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [83]:
# а может быть и в разных классах были пассажиры разного возраста?
print(titanic.groupby(['Sex', 'Pclass'])['Age'].median())
fill_median_by_groups = pd.read_csv('data/titanic.csv')
fill_median_by_groups['Age'].fillna(titanic.groupby(['Sex', 'Pclass'])['Age'].transform('median'), inplace=True)

Sex     Pclass
female  1         35.0
        2         28.0
        3         21.5
male    1         40.0
        2         30.0
        3         25.0
Name: Age, dtype: float64

Заполнение следующими/предыдущими значениями

In [84]:
city_day = pd.read_csv('data/city_day.csv', parse_dates=True, index_col='Date')
city_day.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 29531 entries, 2015-01-01 to 2020-07-01
Data columns (total 15 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        29531 non-null  object
 1   PM2.5       24933 non-null  float64
 2   PM10        18391 non-null  float64
 3   NO          25949 non-null  float64
 4   NO2         25946 non-null  float64
 5   NOx         25346 non-null  float64
 6   NH3         19203 non-null  float64
 7   CO          27472 non-null  float64
 8   SO2         25677 non-null  float64
 9   O3          25509 non-null  float64
 10  Benzene     23908 non-null  float64
 11  Toluene     21490 non-null  float64
 12  Xylene      11422 non-null  float64
 13  AQI         24850 non-null  float64
 14  AQI_Bucket  24850 non-null  object
dtypes: float64(13), object(2)
memory usage: 3.6+ MB

In [86]:
city_day.head(5)

,City,PM2.5,PM10,NO,NO2,NOx,NH3,CO,SO2,O3,Benzene,Toluene,Xylene,AQI,AQI_Bucket
Date,,,,,,,,,,,,,,,
2015-01-01,Ahmedabad,NaN,NaN,0.92,18.22,17.15,NaN,0.92,27.64,133.36,0.00,0.02,0.00,NaN,NaN
2015-01-02,Ahmedabad,NaN,NaN,0.97,15.69,16.46,NaN,0.97,24.55,34.06,3.68,5.50,3.77,NaN,NaN
2015-01-03,Ahmedabad,NaN,NaN,17.40,19.30,29.70,NaN,17.40,29.07,30.70,6.80,16.40,2.25,NaN,NaN
2015-01-04,Ahmedabad,NaN,NaN,1.70,18.48,17.97,NaN,1.70,18.59,36.08,4.43,10.14,1.00,NaN,NaN
2015-01-05,Ahmedabad,NaN,NaN,22.10,21.42,37.76,NaN,22.10,39.33,39.31,7.01,18.89,2.78,NaN,NaN

In [85]:
(city_day.isna().mean() * 100).round(2)

City           0.00
PM2.5         15.57
PM10          37.72
NO            12.13
NO2           12.14
NOx           14.17
NH3           34.97
CO             6.97
SO2           13.05
O3            13.62
Benzene       19.04
Toluene       27.23
Xylene        61.32
AQI           15.85
AQI_Bucket    15.85
dtype: float64

In [88]:
city_day.fillna(method='ffill', inplace=True)
city_day.head(5)

,City,PM2.5,PM10,NO,NO2,NOx,NH3,CO,SO2,O3,Benzene,Toluene,Xylene,AQI,AQI_Bucket
Date,,,,,,,,,,,,,,,
2015-01-01,Ahmedabad,NaN,NaN,0.92,18.22,17.15,NaN,0.92,27.64,133.36,0.00,0.02,0.00,NaN,NaN
2015-01-02,Ahmedabad,NaN,NaN,0.97,15.69,16.46,NaN,0.97,24.55,34.06,3.68,5.50,3.77,NaN,NaN
2015-01-03,Ahmedabad,NaN,NaN,17.40,19.30,29.70,NaN,17.40,29.07,30.70,6.80,16.40,2.25,NaN,NaN
2015-01-04,Ahmedabad,NaN,NaN,1.70,18.48,17.97,NaN,1.70,18.59,36.08,4.43,10.14,1.00,NaN,NaN
2015-01-05,Ahmedabad,NaN,NaN,22.10,21.42,37.76,NaN,22.10,39.33,39.31,7.01,18.89,2.78,NaN,NaN

In [89]:
city_day.fillna(method='bfill', inplace=True)

In [ ]:
(city_day.isna().mean() * 100).round(2)